{"class_name": "Functional", "config": {"name": "model_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 96, 96, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d_17", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_289", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_289", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_18", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_18", "inbound_nodes": [[["activation_289", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_72", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_72", "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_conv_a", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_conv_a", "inbound_nodes": [[["max_pooling2d_72", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_73", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_73", "inbound_nodes": [[["res2_conv_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_conv_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_conv_a", "inbound_nodes": [[["max_pooling2d_73", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_290", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_290", "inbound_nodes": [[["bn2_conv_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_conv_b", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_conv_b", "inbound_nodes": [[["activation_290", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_conv_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_conv_b", "inbound_nodes": [[["res2_conv_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_291", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_291", "inbound_nodes": [[["bn2_conv_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_conv_copy", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_conv_copy", "inbound_nodes": [[["max_pooling2d_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_conv_c", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_conv_c", "inbound_nodes": [[["activation_291", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_74", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_74", "inbound_nodes": [[["res2_conv_copy", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_conv_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_conv_c", "inbound_nodes": [[["res2_conv_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_conv_copy", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_conv_copy", "inbound_nodes": [[["max_pooling2d_74", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_93", "trainable": true, "dtype": "float32"}, "name": "add_93", "inbound_nodes": [[["bn2_conv_c", 0, 0, {}], ["bn2_conv_copy", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_292", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_292", "inbound_nodes": [[["add_93", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_id_1_a", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_id_1_a", "inbound_nodes": [[["activation_292", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_id_1_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_id_1_a", "inbound_nodes": [[["res2_id_1_a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_293", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_293", "inbound_nodes": [[["bn2_id_1_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_id_1_b", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_id_1_b", "inbound_nodes": [[["activation_293", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_id_1_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_id_1_b", "inbound_nodes": [[["res2_id_1_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_294", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_294", "inbound_nodes": [[["bn2_id_1_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_conv__id_1_c", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_conv__id_1_c", "inbound_nodes": [[["activation_294", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_id_1_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_id_1_c", "inbound_nodes": [[["res2_conv__id_1_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_94", "trainable": true, "dtype": "float32"}, "name": "add_94", "inbound_nodes": [[["bn2_id_1_c", 0, 0, {}], ["activation_292", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_295", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_295", "inbound_nodes": [[["add_94", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_id_2_a", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_id_2_a", "inbound_nodes": [[["activation_295", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_id_2_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_id_2_a", "inbound_nodes": [[["res2_id_2_a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_296", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_296", "inbound_nodes": [[["bn2_id_2_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_id_2_b", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_id_2_b", "inbound_nodes": [[["activation_296", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_id_2_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_id_2_b", "inbound_nodes": [[["res2_id_2_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_297", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_297", "inbound_nodes": [[["bn2_id_2_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_id_2_c", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_id_2_c", "inbound_nodes": [[["activation_297", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2_id_2_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2_id_2_c", "inbound_nodes": [[["res2_id_2_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_95", "trainable": true, "dtype": "float32"}, "name": "add_95", "inbound_nodes": [[["bn2_id_2_c", 0, 0, {}], ["activation_295", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_298", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_298", "inbound_nodes": [[["add_95", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_conv_a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_conv_a", "inbound_nodes": [[["activation_298", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_75", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_75", "inbound_nodes": [[["res3_conv_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_conv_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_conv_a", "inbound_nodes": [[["max_pooling2d_75", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_299", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_299", "inbound_nodes": [[["bn3_conv_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_conv_b", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_conv_b", "inbound_nodes": [[["activation_299", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_conv_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_conv_b", "inbound_nodes": [[["res3_conv_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_300", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_300", "inbound_nodes": [[["bn3_conv_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_conv_copy", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_conv_copy", "inbound_nodes": [[["activation_298", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_conv_c", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_conv_c", "inbound_nodes": [[["activation_300", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_76", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_76", "inbound_nodes": [[["res3_conv_copy", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_conv_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_conv_c", "inbound_nodes": [[["res3_conv_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_conv_copy", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_conv_copy", "inbound_nodes": [[["max_pooling2d_76", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_96", "trainable": true, "dtype": "float32"}, "name": "add_96", "inbound_nodes": [[["bn3_conv_c", 0, 0, {}], ["bn3_conv_copy", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_301", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_301", "inbound_nodes": [[["add_96", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_id_1_a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_id_1_a", "inbound_nodes": [[["activation_301", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_id_1_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_id_1_a", "inbound_nodes": [[["res3_id_1_a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_302", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_302", "inbound_nodes": [[["bn3_id_1_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_id_1_b", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_id_1_b", "inbound_nodes": [[["activation_302", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_id_1_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_id_1_b", "inbound_nodes": [[["res3_id_1_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_303", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_303", "inbound_nodes": [[["bn3_id_1_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_conv__id_1_c", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_conv__id_1_c", "inbound_nodes": [[["activation_303", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_id_1_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_id_1_c", "inbound_nodes": [[["res3_conv__id_1_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_97", "trainable": true, "dtype": "float32"}, "name": "add_97", "inbound_nodes": [[["bn3_id_1_c", 0, 0, {}], ["activation_301", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_304", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_304", "inbound_nodes": [[["add_97", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_id_2_a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_id_2_a", "inbound_nodes": [[["activation_304", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_id_2_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_id_2_a", "inbound_nodes": [[["res3_id_2_a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_305", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_305", "inbound_nodes": [[["bn3_id_2_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_id_2_b", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_id_2_b", "inbound_nodes": [[["activation_305", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_id_2_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_id_2_b", "inbound_nodes": [[["res3_id_2_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_306", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_306", "inbound_nodes": [[["bn3_id_2_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_id_2_c", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_id_2_c", "inbound_nodes": [[["activation_306", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3_id_2_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3_id_2_c", "inbound_nodes": [[["res3_id_2_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_98", "trainable": true, "dtype": "float32"}, "name": "add_98", "inbound_nodes": [[["bn3_id_2_c", 0, 0, {}], ["activation_304", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_307", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_307", "inbound_nodes": [[["add_98", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_conv_a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_conv_a", "inbound_nodes": [[["activation_307", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_77", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_77", "inbound_nodes": [[["res4_conv_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_conv_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_conv_a", "inbound_nodes": [[["max_pooling2d_77", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_308", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_308", "inbound_nodes": [[["bn4_conv_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_conv_b", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_conv_b", "inbound_nodes": [[["activation_308", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_conv_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_conv_b", "inbound_nodes": [[["res4_conv_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_309", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_309", "inbound_nodes": [[["bn4_conv_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_conv_copy", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_conv_copy", "inbound_nodes": [[["activation_307", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_conv_c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_conv_c", "inbound_nodes": [[["activation_309", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_78", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_78", "inbound_nodes": [[["res4_conv_copy", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_conv_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_conv_c", "inbound_nodes": [[["res4_conv_c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_conv_copy", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_conv_copy", "inbound_nodes": [[["max_pooling2d_78", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_99", "trainable": true, "dtype": "float32"}, "name": "add_99", "inbound_nodes": [[["bn4_conv_c", 0, 0, {}], ["bn4_conv_copy", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_310", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_310", "inbound_nodes": [[["add_99", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_id_1_a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_id_1_a", "inbound_nodes": [[["activation_310", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_id_1_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_id_1_a", "inbound_nodes": [[["res4_id_1_a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_311", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_311", "inbound_nodes": [[["bn4_id_1_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_id_1_b", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_id_1_b", "inbound_nodes": [[["activation_311", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_id_1_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_id_1_b", "inbound_nodes": [[["res4_id_1_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_312", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_312", "inbound_nodes": [[["bn4_id_1_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_conv__id_1_c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_conv__id_1_c", "inbound_nodes": [[["activation_312", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_id_1_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_id_1_c", "inbound_nodes": [[["res4_conv__id_1_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_100", "trainable": true, "dtype": "float32"}, "name": "add_100", "inbound_nodes": [[["bn4_id_1_c", 0, 0, {}], ["activation_310", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_313", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_313", "inbound_nodes": [[["add_100", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_id_2_a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_id_2_a", "inbound_nodes": [[["activation_313", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_id_2_a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_id_2_a", "inbound_nodes": [[["res4_id_2_a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_314", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_314", "inbound_nodes": [[["bn4_id_2_a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_id_2_b", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_id_2_b", "inbound_nodes": [[["activation_314", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_id_2_b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_id_2_b", "inbound_nodes": [[["res4_id_2_b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_315", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_315", "inbound_nodes": [[["bn4_id_2_b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_id_2_c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_id_2_c", "inbound_nodes": [[["activation_315", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn4_id_2_c", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn4_id_2_c", "inbound_nodes": [[["res4_id_2_c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_101", "trainable": true, "dtype": "float32"}, "name": "add_101", "inbound_nodes": [[["bn4_id_2_c", 0, 0, {}], ["activation_313", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_316", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_316", "inbound_nodes": [[["add_101", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res5_conv_a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": 0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res5_conv_a", "inbound_nodes": [[["activation_316", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_79", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_79", "inbound_nodes": [[["res5_conv_a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": 